notes/interview_preparation_v.org
:PROPERTIES:
:ID:       8C7E9E52-9220-4A7B-B0E6-54F960E17CA8
:END:
#+TITLE: Interview preparation: V

#+BEGIN_ABSTRACT
This note tracks my experience of helping my friend V on their preparation for coding interviews.  It has been awhile since last time that V solved a coding challenge, and as any other skill if you don't practice it you lose it.  I have two purposes for this note: track V's evolution through the preparation and use it as a place to formalize my method on how to improve in problem solving.  By method, I mean the result of experiments that I did on myself (2022) after getting back from many years without practice to coding competitions.  This is a living document and you might visit it multiple times if you want to follow V's journey.
#+END_ABSTRACT
#+TOC: headlines 2

* Coding Interviews

To best define the preparation required for coding interviews, let's compare (coding) interview problems with problems that we usually see on Computer Science's courses.  They require application of knowledge in Data Structure, Algorithms on Graphs and ad-hoc strategies (e.g. Dynamic Programming, Line-Sweeping, Sliding-Window etc).  They differ in two aspects: time to solve and difficult.  You have many days to solve an assignment exercise, but only have 15-20 minutes to solve an interview problem.  Due this difference in time to solve, you can expect interview problems to be easier than most of the assignments that you've done on University.

Due the wide range of topics covered and restriction in time, interview problems are more like final exam's questions on Data Structure and Algorithms courses than assignments.  But there is an important difference.  While you do your exam alone and in silence, you have to verbalize your thoughts while solving the interview problem.  It is definitely an extra challenge, but also an opportunity to engage with the interviewer in case you don't see the solution right away.

The structure and requirements of coding interviews ask for two distinct preparations: studying and performing.  You have to quickly find the solution for the problem using the right data structure, algorithm or technique.  While doing so, you have to perform the interview routine: come up with a solution, explain your thought process and code it in a clear and concise way.  /Learning/ does not need to be time-bounded, since some concepts require time to sink in.  But /performing/ should follow as close as possible a real interview with time constraints and feedback.

A popular way to study is using a curated lists like [[https://leetcode.com/discuss/general-discussion/460599/blind-75-leetcode-questions][Blind 75]].  Such lists cover majority of topics that you see in an interview.  These problems cover specific data structures, algorithms and techniques that work as building blocks for your future solutions.  While these lists are a good start, you might have more success if you discover the kind of problems that your target company asks.  It is not that a company uses only one type of questions, but their interviewers might converge to a sub-set of topics due internal culture or type of business.  Since during the interview you do not know the problem's type, it is wise to also study without using hints like Array, Graphs, DP etc.  To play safe, practice as many topics and problems that you can.


* Spaced-repetition

Spaced-repetition is a study-technique commonly used to memorization of factual information.  It uses flashcard as way to store and review content.  A flashcard has two sides: front and back.  A question or prompt goes in the front of the card, and the information to memorize goes on the back.  For example, you have a picture of someone in the front of the card and their name on the back.  The technique uses the [[https://en.wikipedia.org/wiki/Spacing_effect][spacing effect]] to encode information in the long-term memory by spacing the study sessions, and it is known to have better results than [[https://en.wikipedia.org/wiki/Cramming_(education)][cramming]] (repeat many times in a single session).  Difficult cards appear more often while easier ones are less frequent.  [[https://ankiweb.net/][Anki]] is a well-know and flexible program to manage cards.

How spaced-repetition can be applied to problem solving.  While this technique has proven to be efficient when memorizing facts, it still unclear its impact on other types of study.  My bet is that we can use spaced-repetition to prepare for interviews in the following way.  After you solve a problem, you create a card that contains the problem statement (or simplify a link to the problem) and put on the back the steps that you should take to solve the problem.  By steps, I mean the observation that you found crucial to solve the problem.  Building blocks that you used to solve the problem in the correct order.  For example:

- Constraints require a logarithmic solution.
- One element of the array with its neighbors is enough to decide which side of the array lays the answer.
- Use a Binary-search for find the answer.


* Method
:PROPERTIES:
:ID:       B38C0682-EB89-466F-9645-E89A055D3D99
:END:

An studying session is divided in two parts: solving new problems and reviewing old problems.

*For new problems*, you pick one or two problems per day and spend as much time you need to solve them.  If you solved the problem, follow the instructions on [[id:65FBC7A2-7F72-47E8-9462-58E35974DE1D][Creating a new card]].  Otherwise, give at least one day to try again.  On the second day, you can check a solution to the problem.  The goal is to understand the solution and find the gaps on your knowledge.  There is a data structure that you are not familiar, a particular technique or idea that makes the problem dead easy to solve.  After you learned how to solve the problem (congrats!), [[id:65FBC7A2-7F72-47E8-9462-58E35974DE1D][create a card]] for it and move on.

*For old problems*, you open Anki and practice each available card (/new/ and /for review/).  Avoid reviewing cards using "Easy" button since they schedule a new review for too far way.  Use the "Good" button if you solved the problem without any issues: recalled the steps to solve it and passed the problem on the first try.  The "Hard" button should be used if you had difficult on recalling the steps to solve the problem or when coding it.  Reserve the "Again" button for when you couldn't solve the problem at all.  Be emotionally ready for that because this might happen more often than you expect.


