interview_preparation_v.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Interview preparation: V</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Interview preparation: V</h1>
<div class="ABSTRACT" id="orgdc6be94">
<p>
This note tracks my experience of helping my friend V on their preparation for coding interviews.  It has been awhile since last time that V solved a coding challenge, and as any other skill if you don't practice it you lose it.  I have two purposes for this note: track V's evolution through the preparation and use it as a place to formalize my method on how to improve in problem solving.  By method, I mean the result of experiments that I did on myself (2022) after getting back from many years without practice to coding competitions.  This is a living document and you might visit it multiple times if you want to follow V's journey.
</p>

</div>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb69ac79">Coding Interviews</a></li>
<li><a href="#orge029600">Spaced-repetition</a></li>
<li><a href="#org868d559">Method</a>
<ul>
<li><a href="#orga39653a">Creating a new card</a></li>
</ul>
</li>
<li><a href="#org89fa73e">FAQ</a>
<ul>
<li><a href="#org8b87791">When should I work in a new problem?</a></li>
<li><a href="#org7ce1527">Should I code the solution on every review?</a></li>
<li><a href="#orgf239283">What should I do if I can't solve a problem?</a></li>
</ul>
</li>
<li><a href="#org4878046">Meetings</a>
<ul>
<li><a href="#org8a480f2">December 2, 2022</a></li>
<li><a href="#org9c9847c">December 9, 2022</a></li>
<li><a href="#org041a1f5">December 14, 2022</a></li>
<li><a href="#org26eaa68">December 30, 2022</a></li>
<li><a href="#org12f06d3">February 3, 2023</a></li>
<li><a href="#org852123a">February 10, 2023</a></li>
</ul>
</li>
<li><a href="#org7150dff">Cited by 1</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb69ac79" class="outline-2">
<h2 id="orgb69ac79">Coding Interviews</h2>
<div class="outline-text-2" id="text-orgb69ac79">
<p>
To best define the preparation required for coding interviews, let's compare (coding) interview problems with problems that we usually see on Computer Science's courses.  They require application of knowledge in Data Structure, Algorithms on Graphs and ad-hoc strategies (e.g. Dynamic Programming, Line-Sweeping, Sliding-Window etc).  They differ in two aspects: time to solve and difficult.  You have many days to solve an assignment exercise, but only have 15-20 minutes to solve an interview problem.  Due this difference in time to solve, you can expect interview problems to be easier than most of the assignments that you've done on University.
</p>

<p>
Due the wide range of topics covered and restriction in time, interview problems are more like final exam's questions on Data Structure and Algorithms courses than assignments.  But there is an important difference.  While you do your exam alone and in silence, you have to verbalize your thoughts while solving the interview problem.  It is definitely an extra challenge, but also an opportunity to engage with the interviewer in case you don't see the solution right away.
</p>

<p>
The structure and requirements of coding interviews ask for two distinct preparations: studying and performing.  You have to quickly find the solution for the problem using the right data structure, algorithm or technique.  While doing so, you have to perform the interview routine: come up with a solution, explain your thought process and code it in a clear and concise way.  <i>Learning</i> does not need to be time-bounded, since some concepts require time to sink in.  But <i>performing</i> should follow as close as possible a real interview with time constraints and feedback.
</p>

<p>
A popular way to study is using a curated lists like <a href="https://leetcode.com/discuss/general-discussion/460599/blind-75-leetcode-questions">Blind 75</a>.  Such lists cover majority of topics that you see in an interview.  These problems cover specific data structures, algorithms and techniques that work as building blocks for your future solutions.  While these lists are a good start, you might have more success if you discover the kind of problems that your target company asks.  It is not that a company uses only one type of questions, but their interviewers might converge to a sub-set of topics due internal culture or type of business.  Since during the interview you do not know the problem's type, it is wise to also study without using hints like Array, Graphs, DP etc.  To play safe, practice as many topics and problems that you can.
</p>
</div>
</div>


<div id="outline-container-orge029600" class="outline-2">
<h2 id="orge029600">Spaced-repetition</h2>
<div class="outline-text-2" id="text-orge029600">
<p>
Spaced-repetition is a study-technique commonly used to memorization of factual information.  It uses flashcard as way to store and review content.  A flashcard has two sides: front and back.  A question or prompt goes in the front of the card, and the information to memorize goes on the back.  For example, you have a picture of someone in the front of the card and their name on the back.  The technique uses the <a href="https://en.wikipedia.org/wiki/Spacing_effect">spacing effect</a> to encode information in the long-term memory by spacing the study sessions, and it is known to have better results than <a href="https://en.wikipedia.org/wiki/Cramming_(education)">cramming</a> (repeat many times in a single session).  Difficult cards appear more often while easier ones are less frequent.  <a href="https://ankiweb.net/">Anki</a> is a well-know and flexible program to manage cards.
</p>

<p>
How spaced-repetition can be applied to problem solving.  While this technique has proven to be efficient when memorizing facts, it still unclear its impact on other types of study.  My bet is that we can use spaced-repetition to prepare for interviews in the following way.  After you solve a problem, you create a card that contains the problem statement (or simplify a link to the problem) and put on the back the steps that you should take to solve the problem.  By steps, I mean the observation that you found crucial to solve the problem.  Building blocks that you used to solve the problem in the correct order.  For example:
</p>

<ul class="org-ul">
<li>Constraints require a logarithmic solution.</li>
<li>One element of the array with its neighbors is enough to decide which side of the array lays the answer.</li>
<li>Use a Binary-search for find the answer.</li>
</ul>
</div>
</div>


<div id="outline-container-org868d559" class="outline-2">
<h2 id="org868d559">Method</h2>
<div class="outline-text-2" id="text-org868d559">
<p>
An studying session is divided in two parts: solving new problems and reviewing old problems.
</p>

<p>
<b>For new problems</b>, you pick one or two problems per day and spend as much time you need to solve them.  If you solved the problem, follow the instructions on <a href="#orga39653a">Creating a new card</a>.  Otherwise, give at least one day to try again.  On the second day, you can check a solution to the problem.  The goal is to understand the solution and find the gaps on your knowledge.  There is a data structure that you are not familiar, a particular technique or idea that makes the problem dead easy to solve.  After you learned how to solve the problem (congrats!), <a href="#orga39653a">create a card</a> for it and move on.
</p>

<p>
<b>For old problems</b>, you open Anki and practice each available card (<i>new</i> and <i>for review</i>).  Avoid reviewing cards using "Easy" button since they schedule a new review for too far way.  Use the "Good" button if you solved the problem without any issues: recalled the steps to solve it and passed the problem on the first try.  The "Hard" button should be used if you had difficult on recalling the steps to solve the problem or when coding it.  Reserve the "Again" button for when you couldn't solve the problem at all.  Be emotionally ready for that because this might happen more often than you expect.
</p>
</div>
