notes/interview_preparation_v.org
** Creating a new card
:PROPERTIES:
:ID:       65FBC7A2-7F72-47E8-9462-58E35974DE1D
:END:

The front of the card has a link for the problem.  The back of the card has the steps to solve the problem and optionally an example for the solution.  You might get stuck trying to write the /perfect/ card.  Don't bother with this.  You will have many opportunities to improve them after a review session.


* FAQ

** When should I work in a new problem?

Don't start working in a new problem if you have more reviews than you have time to get them done in a day, or you already have new cards waiting for you.  It is easy to get overwhelmed with the number of reviews.  Striving for consistency will bring better results than rushing every other day.

** Should I code the solution on every review?

Yes!  Reconstructing your steps to the solution and writing the code again will cement the building blocks on your memory.

** What should I do if I can't solve a problem?

First of all, that is fine and will happen more frequently than you imagine.  Give at least one day before looking to solutions.  After you read and *understand* a solution, ask yourself "what steps should I have done to solve this problem?".  Create a card with these steps and review it as any other card.


* Meetings

** December 2, 2022

The goal of this method is to use spaced-repetition to build your intuition to solve coding challenges.  The card has the path to solve the problem and this will be internalized after many repetitions.  When solving new problems, a thought will scream at you "Binary Search!" or "This is a Graph Problem".  In fact, this is not much different of how we learned math.  How many times did you verbalize the steps to isolate $x$ in an equation?  You used descriptive knowledge to build the intuition muscle that later on helped you to perform simplification without using much mental energy.

For next session, you will work in [[https://leetcode.com/contest/weekly-contest-320/][4 problems]] which you should apply the method: solve them, create and review the cards.  We will review your thought process to solve these problems and what worked and didn't work when create and reviewing your cards:

  - [X] [[id:AD689352-C66F-4BFC-95A4-65B58110A851][Leetcode: 2475. Number of Unequal Triplets in Array]]
  - [X] [[id:7F2BA5B5-2C29-40AE-A4D3-B3D438A660C9][Leetcode: 2476. Closest Nodes Queries in a Binary Search Tree]]
  - [X] [[id:47D88994-CD09-41C5-A3BA-9EDF2B9AB80E][Leetcode: 2477. Minimum Fuel Cost to Report to the Capital]]
  - [ ] [[id:D500C3CF-B17C-4C7D-90F2-BFA02AB1C9D6][Leetcode: 2478. Number of Beautiful Partitions]]

** December 9, 2022

*** Performing a solution

- Found the worst case but didn't narrow the search for the optimal algorithm to that case.
- Explain what are chucks and how to use them.
  - [[https://www.theroar.com.au/2016/12/19/ten-ways-get-cricket-including-youve-never-seen/][What are the ways to be dismissed in cricket?]]
    - Define one of them.
    - Define other one.
    - Contrast them.
- Things that will improve over time:
  - Proficiency in the selected Programming Language.
  - Formulate a high-level plan and execute each part in isolation.

*** Problems

We will start with [[https://leetcode.com/discuss/general-discussion/460599/blind-75-leetcode-questions][Blind 75]] problems.  As we work through them, we will find that few areas should get more attention.  For those, I will add problems to increase your proficiency on specific building blocks.  Here is the list of problems for this week:

- Blind 75:
  - [X] [[https://leetcode.com/problems/two-sum/][Two Sum]] ([[id:5F25DCD8-CE46-4F18-A1B1-952BC35382A9][solution]]).
  - [X] [[https://leetcode.com/problems/best-time-to-buy-and-sell-stock/][Best Time to Buy and Sell Stock]] ([[id:81682CDD-4D5A-485C-9C1C-5689B6AF1A41][solution]]).
  - [X] [[https://leetcode.com/problems/contains-duplicate/][Contains Duplicate]] ([[id:2E185F52-087B-4CBC-B927-1DD24C880E04][solution]] *NEW!*).
- Supplement:
  - [X] [[https://leetcode.com/problems/binary-tree-inorder-traversal/][Binary Tree Inorder Traversal]].

** December 14, 2022

