interview_preparation_v.html


<div id="outline-container-orga39653a" class="outline-3">
<h3 id="orga39653a">Creating a new card</h3>
<div class="outline-text-3" id="text-orga39653a">
<p>
The front of the card has a link for the problem.  The back of the card has the steps to solve the problem and optionally an example for the solution.  You might get stuck trying to write the <i>perfect</i> card.  Don't bother with this.  You will have many opportunities to improve them after a review session.
</p>
</div>
</div>
</div>


<div id="outline-container-org89fa73e" class="outline-2">
<h2 id="org89fa73e">FAQ</h2>
<div class="outline-text-2" id="text-org89fa73e">
</div>
<div id="outline-container-org8b87791" class="outline-3">
<h3 id="org8b87791">When should I work in a new problem?</h3>
<div class="outline-text-3" id="text-org8b87791">
<p>
Don't start working in a new problem if you have more reviews than you have time to get them done in a day, or you already have new cards waiting for you.  It is easy to get overwhelmed with the number of reviews.  Striving for consistency will bring better results than rushing every other day.
</p>
</div>
</div>

<div id="outline-container-org7ce1527" class="outline-3">
<h3 id="org7ce1527">Should I code the solution on every review?</h3>
<div class="outline-text-3" id="text-org7ce1527">
<p>
Yes!  Reconstructing your steps to the solution and writing the code again will cement the building blocks on your memory.
</p>
</div>
</div>

<div id="outline-container-orgf239283" class="outline-3">
<h3 id="orgf239283">What should I do if I can't solve a problem?</h3>
<div class="outline-text-3" id="text-orgf239283">
<p>
First of all, that is fine and will happen more frequently than you imagine.  Give at least one day before looking to solutions.  After you read and <b>understand</b> a solution, ask yourself "what steps should I have done to solve this problem?".  Create a card with these steps and review it as any other card.
</p>
</div>
</div>
</div>


<div id="outline-container-org4878046" class="outline-2">
<h2 id="org4878046">Meetings</h2>
<div class="outline-text-2" id="text-org4878046">
</div>
<div id="outline-container-org8a480f2" class="outline-3">
<h3 id="org8a480f2">December 2, 2022</h3>
<div class="outline-text-3" id="text-org8a480f2">
<p>
The goal of this method is to use spaced-repetition to build your intuition to solve coding challenges.  The card has the path to solve the problem and this will be internalized after many repetitions.  When solving new problems, a thought will scream at you "Binary Search!" or "This is a Graph Problem".  In fact, this is not much different of how we learned math.  How many times did you verbalize the steps to isolate \(x\) in an equation?  You used descriptive knowledge to build the intuition muscle that later on helped you to perform simplification without using much mental energy.
</p>

<p>
For next session, you will work in <a href="https://leetcode.com/contest/weekly-contest-320/">4 problems</a> which you should apply the method: solve them, create and review the cards.  We will review your thought process to solve these problems and what worked and didn't work when create and reviewing your cards:
</p>

<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="leetcode_2475_number_of_unequal_triplets_in_array.html#ID-AD689352-C66F-4BFC-95A4-65B58110A851">Leetcode: 2475. Number of Unequal Triplets in Array</a></li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="leetcode_2476_closest_nodes_queries_in_a_binary_search_tree.html#ID-7F2BA5B5-2C29-40AE-A4D3-B3D438A660C9">Leetcode: 2476. Closest Nodes Queries in a Binary Search Tree</a></li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="leetcode_2477_minimum_fuel_cost_to_report_to_the_capital.html#ID-47D88994-CD09-41C5-A3BA-9EDF2B9AB80E">Leetcode: 2477. Minimum Fuel Cost to Report to the Capital</a></li>
<li class="off"><input type='checkbox' disabled='disabled' /> <a href="leetcode_2478_number_of_beautiful_partitions.html#ID-D500C3CF-B17C-4C7D-90F2-BFA02AB1C9D6">Leetcode: 2478. Number of Beautiful Partitions</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9c9847c" class="outline-3">
<h3 id="org9c9847c">December 9, 2022</h3>
<div class="outline-text-3" id="text-org9c9847c">
</div>
<div id="outline-container-orgdc10f33" class="outline-4">
<h4 id="orgdc10f33">Performing a solution</h4>
<div class="outline-text-4" id="text-orgdc10f33">
<ul class="org-ul">
<li>Found the worst case but didn't narrow the search for the optimal algorithm to that case.</li>
<li>Explain what are chucks and how to use them.
<ul class="org-ul">
<li><a href="https://www.theroar.com.au/2016/12/19/ten-ways-get-cricket-including-youve-never-seen/">What are the ways to be dismissed in cricket?</a>
<ul class="org-ul">
<li>Define one of them.</li>
<li>Define other one.</li>
<li>Contrast them.</li>
</ul></li>
</ul></li>
<li>Things that will improve over time:
<ul class="org-ul">
<li>Proficiency in the selected Programming Language.</li>
<li>Formulate a high-level plan and execute each part in isolation.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge990523" class="outline-4">
<h4 id="orge990523">Problems</h4>
<div class="outline-text-4" id="text-orge990523">
<p>
We will start with <a href="https://leetcode.com/discuss/general-discussion/460599/blind-75-leetcode-questions">Blind 75</a> problems.  As we work through them, we will find that few areas should get more attention.  For those, I will add problems to increase your proficiency on specific building blocks.  Here is the list of problems for this week:
</p>

<ul class="org-ul">
<li>Blind 75:
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/two-sum/">Two Sum</a> (<a href="leetcode_1_two_sum.html#ID-5F25DCD8-CE46-4F18-A1B1-952BC35382A9">solution</a>).</li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/best-time-to-buy-and-sell-stock/">Best Time to Buy and Sell Stock</a> (<a href="leetcode_121_best_time_to_buy_and_sell_stock.html#ID-81682CDD-4D5A-485C-9C1C-5689B6AF1A41">solution</a>).</li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/contains-duplicate/">Contains Duplicate</a> (<a href="leetcode_217_contains_duplicate.html#ID-2E185F52-087B-4CBC-B927-1DD24C880E04">solution</a> <b>NEW!</b>).</li>
</ul></li>
<li>Supplement:
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/binary-tree-inorder-traversal/">Binary Tree Inorder Traversal</a>.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org041a1f5" class="outline-3">
<h3 id="org041a1f5">December 14, 2022</h3>
<div class="outline-text-3" id="text-org041a1f5">
</div>
