interview_preparation_v.html
<div id="outline-container-orga2dc05c" class="outline-4">
<h4 id="orga2dc05c">Review last week's problems</h4>
<div class="outline-text-4" id="text-orga2dc05c">
<ul class="org-ul">
<li>Done well.

<ul class="org-ul">
<li>Read the problem and checked the problem's constraints.</li>

<li>Used the problem constraints to define an upper bound for the solution's time complexity.</li>
</ul></li>

<li>Things to improve:

<ul class="org-ul">
<li>You might think that easy problems are waste of time.  They are not.  Easy problems help you to solidify building blocks, become proficient in your chosen programming language, focus on recalling the patterns and prompts, and finally explain the problem in a concise way.  Leave to the spaced-repetition the task to decide which problem you have to review.  Over time, the easy problems will appear less frequently than the challenging ones.</li>

<li>You added "Convert list to set" as one pattern in your card.  A pattern is word or sentence that abstract the problem or part of it.  Here is some examples of patterns: "Binary Balance Tree", "Directed Graph", "String Search", "Searching in Array".  Note that they generalize the problem in terms that are easier to associate with.  We are going to upse these terms (or sentences) as hooks to grab ideas from previous problems that we solved.  You think "Directed Graph", and few seconds later "poof" you think "Are there cycles in this Graph?".</li>

<li>While we love functional programming, imperative programming is usually a better choice for problem solving.  It is possible to use immutable data structures, lambdas, maps, filters, and etc, but a simple for loop can reduce 10-15 lines of functional programming to 3 lines.  Remember that less code means less surface for errors.</li>
</ul></li>

<li>Questions about the training:

<ul class="org-ul">
<li>Are you doing at least one/two reviews per day?
<ul class="org-ul">
<li>Every two days.</li>
</ul></li>
<li>Is the number of reviews sustainable?
<ul class="org-ul">
<li>Yes. Problems are small and there is no issue so far.</li>
</ul></li>
<li>Have you had chance to look the solutions available here?
<ul class="org-ul">
<li>Yes, but didn't understand part of the solution.</li>
</ul></li>
<li>What insight did you extract after using this method in the last two weeks?
<ul class="org-ul">
<li>Solution for the past problems come to mind after much effort and don't require paper work before start coding.</li>
</ul></li>
</ul></li>

<li>Questions about the problems:

<ul class="org-ul">
<li>What is common in the solution for these problems?  We have to use extra memory to solve the searching problem in \(O(1)\).  In <a href="improve_performance_using_more_memory.html#ID-AF49B2EA-A026-4E91-A4EC-423123E63A9B">Improve Performance Using More Memory</a>, I argued why sometimes this is the case for improving performance.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org89d850b" class="outline-4">
<h4 id="org89d850b">Next problems</h4>
<div class="outline-text-4" id="text-org89d850b">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/product-of-array-except-self/">Product of Array Except Self</a> (<a href="leetcode_238_product_of_array_except_self.html#ID-489C947E-AD8A-4611-B8F7-DD0BB44ABAE5">solution</a>)</li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/maximum-subarray/">Maximum Subarray</a> (<a href="leetcode_53_maximum_subarray.html#ID-01AB9AC6-5E8D-49BB-9533-92B7032CFDE3">solution</a>)</li>
<li class="off"><input type='checkbox' disabled='disabled' /> <a href="https://leetcode.com/problems/maximum-product-subarray/">Maximum Product Subarray</a> (<a href="leetcode_152_maximum_product_subarray.html#ID-D821DCA2-8A6A-4650-BD9E-D9B78F446901">solution</a>)</li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/find-minimum-in-rotated-sorted-array/">Find Minimum in Rotated Sorted Array</a> (<a href="leetcode_153_find_minimum_in_rotated_sorted_array.html#ID-C1F8B8F2-72CF-4085-852C-4D1EF8E19195">solution</a>)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org26eaa68" class="outline-3">
<h3 id="org26eaa68">December 30, 2022</h3>
<div class="outline-text-3" id="text-org26eaa68">
<ul class="org-ul">
<li>Review of a card
<ul class="org-ul">
<li><a href="https://leetcode.com/problems/find-minimum-in-rotated-sorted-array/">Find Minimum in Rotated Sorted Array</a>
<ul class="org-ul">
<li>Wrote the patterns and prompts as comments in the code.
<ul class="org-ul">
<li>It has can make easier to compare with the card and assess the review.</li>
<li>It makes easier to direct focus.</li>
</ul></li>
<li>Implemented his solution and than the alternative one.
<ul class="org-ul">
<li>The familiarity with the language is noticeable.  Good job!</li>
<li>It is fine to breakdown the problem in smaller sub problems.</li>
<li>There is no problem with writing the recursive version of binary search, but the interviewer will ask you to save memory (stack) by having the iterative version.</li>
<li>Is there something that is blocking you to get to the alternative solution from the begin?</li>
<li>What is the difference between both approaches?</li>
</ul></li>
</ul></li>
</ul></li>

<li>As I mentioned before, I developed this method after 9 years without working on problem solving.  This is an example of how I improved by following this method:  <a href="https://leetcode.com/problems/maximum-subarray/submissions/541620453/">old solution</a> from Aug 2021 vs <a href="https://leetcode.com/problems/maximum-subarray/submissions/860511074/">new solution</a> from December 2022.  I knew that this is a classical problem, but I didn't remember that I solved it on Leetcode.  The new solution is shorter and straight to the point, while the old one is unnecessarily complex.</li>
</ul>
</div>
