notes/interview_preparation_v.org
*** Next problems

- [X] [[https://leetcode.com/problems/search-in-rotated-sorted-array/][Search in Rotated Sorted Array]] ([[id:DE8C7F14-D36F-43BF-8AF1-B6940406EBF6][solution]] *NEW!*)
- [X] [[https://leetcode.com/problems/3sum/][3 Sum]] ([[id:F46A0FDA-FF12-42FF-8BA1-FEAC7D9B6A4B][solution]] *NEW!*)
- [X] [[https://leetcode.com/problems/container-with-most-water/][Container With Most Water]] ([[id:2EA371C3-FF87-4506-BE17-1AA2BDF0AB42][solution]] *NEW!*)
- [X] [[https://leetcode.com/problems/sum-of-two-integers/][Sum of Two Integers]]
- [X] [[https://leetcode.com/problems/number-of-1-bits/][Number of 1 Bits]] ([[id:9C506DBD-693B-46D8-9CA4-8B7C7D573092][solution]] *NEW!*)
- [X] [[https://leetcode.com/problems/counting-bits/][Counting Bits]] ([[id:BEB1C18C-3B4F-4805-913A-6E3EF9573515][solution]] *NEW!*)
- [X] [[https://leetcode.com/problems/missing-number/][Missing Number]] ([[id:A3920C94-A219-445F-987A-E2A08FFE8C46][solution]] *NEW!*)
- [X] [[https://leetcode.com/problems/reverse-bits/][Reverse Bits]]
- [X] [[https://leetcode.com/problems/climbing-stairs/][Climbing Stairs]]
- [X] [[https://leetcode.com/problems/coin-change/][Coin Change]]
- [X] [[https://leetcode.com/problems/longest-increasing-subsequence/][Longest Increasing Subsequence]]
- [X] [[https://leetcode.com/problems/longest-common-subsequence/][Longest Common Subsequence]]
- [X] [[https://leetcode.com/problems/word-break/][Word Break Problem]]
- [X] [[https://leetcode.com/problems/combination-sum-iv/][Combination Sum]]
- [X] [[https://leetcode.com/problems/house-robber/][House Robber]]
- [X] [[https://leetcode.com/problems/house-robber-ii/][House Robber II]]
- [X] [[https://leetcode.com/problems/decode-ways/][Decode Ways]]
- [X] [[https://leetcode.com/problems/jump-game/][Jump Game]]
- [X] [[https://leetcode.com/problems/insert-interval/][Insert Interval]]
- [X] [[https://leetcode.com/problems/merge-intervals/][Merge Intervals]]

** February 3, 2023

- Question from V :: How do you organize your knowledge about algorithms and techniques?

  - Years ago, it was allowed to bring a booklet as reference material to competition.  So, I had my booklet with important algorithms and ideas that I judged useful to bring to the competitions.  I didn't include simple algorithms like DFS or BFS, but ones that are hard or trickier to write.  For interview preparation, this is not required since you will end up training frequent problems that appear on interviews and they won't use complex algorithms or ideas.  Besides that, there is a human need to organize knowledge into hierarchies.  You shouldn't fall in this trap.  Let the problems tell what topic you have to master, and let the space repetition decide what material you have to master or not.

- Question from V :: Should we study algorithms or techniques in isolation?

  - I don't think that it is necessary.  The review process takes care of exercising all components of the problem solving skill: extract the patterns from the text, recall algorithms/techniques/ideas using the patterns, adapting previous knowledge to the problem and implementing it.  If you focus to execute every single step to the perfection, you will not only sharp your algorithms and techniques but the necessary connections to apply them in practice.

*** Next problems

- [ ] [[https://leetcode.com/problems/unique-paths/][Unique Paths]]
- [ ] [[https://leetcode.com/problems/clone-graph/][Clone Graph]]
- [ ] [[https://leetcode.com/problems/course-schedule/][Course Schedule]]
- [ ] [[https://leetcode.com/problems/pacific-atlantic-water-flow/][Pacific Atlantic Water Flow]]
- [ ] [[https://leetcode.com/problems/number-of-islands/][Number of Islands]]
- [ ] [[https://leetcode.com/problems/longest-consecutive-sequence/][Longest Consecutive Sequence]]
- [ ] [[https://leetcode.com/problems/alien-dictionary/][Alien Dictionary (Leetcode Premium)]]
- [ ] [[https://leetcode.com/problems/graph-valid-tree/][Graph Valid Tree (Leetcode Premium)]]
- [ ] [[https://leetcode.com/problems/number-of-connected-components-in-an-undirected-graph/][Number of Connected Components in an Undirected Graph (Leetcode Premium)]]
- [ ] [[https://leetcode.com/problems/non-overlapping-intervals/][Non-overlapping Intervals]]
- [ ] [[https://leetcode.com/problems/meeting-rooms/][Meeting Rooms (Leetcode Premium)]]
- [ ] [[https://leetcode.com/problems/meeting-rooms-ii/][Meeting Rooms II (Leetcode Premium)]]
- Extra:
  - [ ] [[https://leetcode.com/problems/find-peak-element/][Find Peak Element]] ([[id:E4E1316F-92A3-4C51-8FC6-16A39DD1C1CE][solution]])
  - [ ] [[https://leetcode.com/problems/two-sum-ii-input-array-is-sorted/][Two Sum II - Input Array Is Sorted]] ([[id:1C65AE58-2344-4F0A-A336-77E587E81033][solution]] *NEW!*)

