interview_preparation_v.html


<div id="outline-container-org133802b" class="outline-4">
<h4 id="org133802b">Next problems</h4>
<div class="outline-text-4" id="text-org133802b">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/search-in-rotated-sorted-array/">Search in Rotated Sorted Array</a> (<a href="leetcode_33_search_in_rotated_sorted_array.html#ID-DE8C7F14-D36F-43BF-8AF1-B6940406EBF6">solution</a> <b>NEW!</b>)</li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/3sum/">3 Sum</a> (<a href="leetcode_15_3sum.html#ID-F46A0FDA-FF12-42FF-8BA1-FEAC7D9B6A4B">solution</a> <b>NEW!</b>)</li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/container-with-most-water/">Container With Most Water</a> (<a href="leetcode_11_container_with_most_water.html#ID-2EA371C3-FF87-4506-BE17-1AA2BDF0AB42">solution</a> <b>NEW!</b>)</li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/sum-of-two-integers/">Sum of Two Integers</a></li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/number-of-1-bits/">Number of 1 Bits</a> (<a href="leetcode_191_number_of_1_bits.html#ID-9C506DBD-693B-46D8-9CA4-8B7C7D573092">solution</a> <b>NEW!</b>)</li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/counting-bits/">Counting Bits</a> (<a href="leetcode_338_counting_bits.html#ID-BEB1C18C-3B4F-4805-913A-6E3EF9573515">solution</a> <b>NEW!</b>)</li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/missing-number/">Missing Number</a> (<a href="leetcode_268_missing_number.html#ID-A3920C94-A219-445F-987A-E2A08FFE8C46">solution</a> <b>NEW!</b>)</li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/reverse-bits/">Reverse Bits</a></li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/climbing-stairs/">Climbing Stairs</a></li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/coin-change/">Coin Change</a></li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/longest-increasing-subsequence/">Longest Increasing Subsequence</a></li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/longest-common-subsequence/">Longest Common Subsequence</a></li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/word-break/">Word Break Problem</a></li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/combination-sum-iv/">Combination Sum</a></li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/house-robber/">House Robber</a></li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/house-robber-ii/">House Robber II</a></li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/decode-ways/">Decode Ways</a></li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/jump-game/">Jump Game</a></li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/insert-interval/">Insert Interval</a></li>
<li class="on"><input type='checkbox' checked='checked' disabled='disabled'/> <a href="https://leetcode.com/problems/merge-intervals/">Merge Intervals</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org12f06d3" class="outline-3">
<h3 id="org12f06d3">February 3, 2023</h3>
<div class="outline-text-3" id="text-org12f06d3">
<dl class="org-dl">
<dt>Question from V</dt><dd>How do you organize your knowledge about algorithms and techniques?

<ul class="org-ul">
<li>Years ago, it was allowed to bring a booklet as reference material to competition.  So, I had my booklet with important algorithms and ideas that I judged useful to bring to the competitions.  I didn't include simple algorithms like DFS or BFS, but ones that are hard or trickier to write.  For interview preparation, this is not required since you will end up training frequent problems that appear on interviews and they won't use complex algorithms or ideas.  Besides that, there is a human need to organize knowledge into hierarchies.  You shouldn't fall in this trap.  Let the problems tell what topic you have to master, and let the space repetition decide what material you have to master or not.</li>
</ul></dd>

<dt>Question from V</dt><dd>Should we study algorithms or techniques in isolation?

<ul class="org-ul">
<li>I don't think that it is necessary.  The review process takes care of exercising all components of the problem solving skill: extract the patterns from the text, recall algorithms/techniques/ideas using the patterns, adapting previous knowledge to the problem and implementing it.  If you focus to execute every single step to the perfection, you will not only sharp your algorithms and techniques but the necessary connections to apply them in practice.</li>
</ul></dd>
</dl>
</div>

<div id="outline-container-orgef59080" class="outline-4">
<h4 id="orgef59080">Next problems</h4>
<div class="outline-text-4" id="text-orgef59080">
<ul class="org-ul">
<li class="off"><input type='checkbox' disabled='disabled' /> <a href="https://leetcode.com/problems/unique-paths/">Unique Paths</a></li>
<li class="off"><input type='checkbox' disabled='disabled' /> <a href="https://leetcode.com/problems/clone-graph/">Clone Graph</a></li>
<li class="off"><input type='checkbox' disabled='disabled' /> <a href="https://leetcode.com/problems/course-schedule/">Course Schedule</a></li>
<li class="off"><input type='checkbox' disabled='disabled' /> <a href="https://leetcode.com/problems/pacific-atlantic-water-flow/">Pacific Atlantic Water Flow</a></li>
<li class="off"><input type='checkbox' disabled='disabled' /> <a href="https://leetcode.com/problems/number-of-islands/">Number of Islands</a></li>
<li class="off"><input type='checkbox' disabled='disabled' /> <a href="https://leetcode.com/problems/longest-consecutive-sequence/">Longest Consecutive Sequence</a></li>
<li class="off"><input type='checkbox' disabled='disabled' /> <a href="https://leetcode.com/problems/alien-dictionary/">Alien Dictionary (Leetcode Premium)</a></li>
<li class="off"><input type='checkbox' disabled='disabled' /> <a href="https://leetcode.com/problems/graph-valid-tree/">Graph Valid Tree (Leetcode Premium)</a></li>
<li class="off"><input type='checkbox' disabled='disabled' /> <a href="https://leetcode.com/problems/number-of-connected-components-in-an-undirected-graph/">Number of Connected Components in an Undirected Graph (Leetcode Premium)</a></li>
<li class="off"><input type='checkbox' disabled='disabled' /> <a href="https://leetcode.com/problems/non-overlapping-intervals/">Non-overlapping Intervals</a></li>
<li class="off"><input type='checkbox' disabled='disabled' /> <a href="https://leetcode.com/problems/meeting-rooms/">Meeting Rooms (Leetcode Premium)</a></li>
<li class="off"><input type='checkbox' disabled='disabled' /> <a href="https://leetcode.com/problems/meeting-rooms-ii/">Meeting Rooms II (Leetcode Premium)</a></li>
<li>Extra:
<ul class="org-ul">
<li class="off"><input type='checkbox' disabled='disabled' /> <a href="https://leetcode.com/problems/find-peak-element/">Find Peak Element</a> (<a href="leetcode_162_find_peak_element.html#ID-E4E1316F-92A3-4C51-8FC6-16A39DD1C1CE">solution</a>)</li>
<li class="off"><input type='checkbox' disabled='disabled' /> <a href="https://leetcode.com/problems/two-sum-ii-input-array-is-sorted/">Two Sum II - Input Array Is Sorted</a> (<a href="leetcode_167_two_sum_ii_input_array_is_sorted.html#ID-1C65AE58-2344-4F0A-A336-77E587E81033">solution</a> <b>NEW!</b>)</li>
</ul></li>
</ul>
</div>
</div>
</div>
