notes/interview_preparation_v.org
** February 10, 2023

In this meeting, we discussed the challenges of understanding problems before solving them.  We asked questions like what is our state of mind before and after we understand something?  Why is it so difficult to hold the urge to start solving the problem while we are reading it?  What can we use to improve our reading skills?  We discovered that by using active reading techniques, we can enhance our understanding of problems and improve our ability to solve them.

Let's start with an experiment:

- Take a problem statement or a paragraph from a book that you never read before.
- Read it as you normally read.
- Close the book or switch to other tab in your browser and explain what you've read.
- Do it again 3 to 5 times.

You will find that the recall became better and better with each repetition.  The first recall was disorganized and the last one was organized and fluid, like a story.  You might have tried to see part of the page with your mind's eye on the first recall.  But gradually, it became unnecessary as the chain of thoughts formed after each repetition.  You started empty and finished with a piece of knowledge inside yourself.

What did you feel on each repetition and how did it change over time?  I bet that recognizing this difference can help us understand when we should spend more time to really understand something.  I asked four people to do this experiment and to report what they felt.  The answers were essentially about becoming less anxious and disorganized and more calm and organized.  And this is the clue that we can use.

Our reading skills have everything to do with our problem solving skills.  As stated in the famous book "[[https://en.wikipedia.org/wiki/How_to_Solve_It][How To Solve It by George Polya]]", the first step of solving a problem is understating it.  To understand the problem, we have to read it.  And let's be honest,  we usually read the problem once and try to solve it as we go along.

We tried to address the issue using active reading techniques.  Here is the process that we followed:

  1. Read the problem quickly to get an overall idea.
  2. Read the problem in normal speed to discover important parts.
  3. Take a break and focus on the next 10 breathes (yep! like in meditation).
  4. Read the problem slowly to ensure full understand.

After each step, ask yourself "What is this problem about?".  V and I tested this method in Leetcode problems and found an impressive improvement in recall quality.  The difference was "night and day".

In conclusion, I will incorporate active reading in my training routine and will report back the results in the future.


* Blind 75 :noexport:

- Array
  - [[https://leetcode.com/problems/two-sum/][Two Sum]]
  - [[https://leetcode.com/problems/best-time-to-buy-and-sell-stock/][Best Time to Buy and Sell Stock]]
  - [[https://leetcode.com/problems/contains-duplicate/][Contains Duplicate]]
  - [[https://leetcode.com/problems/product-of-array-except-self/][Product of Array Except Self]]
  - [[https://leetcode.com/problems/maximum-subarray/][Maximum Subarray]]
  - [[https://leetcode.com/problems/maximum-product-subarray/][Maximum Product Subarray]]
  - [[https://leetcode.com/problems/find-minimum-in-rotated-sorted-array/][Find Minimum in Rotated Sorted Array]]
  - [[https://leetcode.com/problems/search-in-rotated-sorted-array/][Search in Rotated Sorted Array]]
  - [[https://leetcode.com/problems/3sum/][3 Sum]]
  - [[https://leetcode.com/problems/container-with-most-water/][Container With Most Water]]
- Binary
  - [[https://leetcode.com/problems/sum-of-two-integers/][Sum of Two Integers]]
  - [[https://leetcode.com/problems/number-of-1-bits/][Number of 1 Bits]]
  - [[https://leetcode.com/problems/counting-bits/][Counting Bits]]
  - [[https://leetcode.com/problems/missing-number/][Missing Number]]
  - [[https://leetcode.com/problems/reverse-bits/][Reverse Bits]]
- Dynamic Programming
  - [[https://leetcode.com/problems/climbing-stairs/][Climbing Stairs]]
  - [[https://leetcode.com/problems/coin-change/][Coin Change]]
  - [[https://leetcode.com/problems/longest-increasing-subsequence/][Longest Increasing Subsequence]]
  - [[https://leetcode.com/problems/longest-common-subsequence/][Longest Common Subsequence]]
  - [[https://leetcode.com/problems/word-break/][Word Break Problem]]
  - [[https://leetcode.com/problems/combination-sum-iv/][Combination Sum]]
  - [[https://leetcode.com/problems/house-robber/][House Robber]]
  - [[https://leetcode.com/problems/house-robber-ii/][House Robber II]]
  - [[https://leetcode.com/problems/decode-ways/][Decode Ways]]
  - [[https://leetcode.com/problems/unique-paths/][Unique Paths]]
  - [[https://leetcode.com/problems/jump-game/][Jump Game]]
- Graph
  - [[https://leetcode.com/problems/clone-graph/][Clone Graph]]
  - [[https://leetcode.com/problems/course-schedule/][Course Schedule]]
  - [[https://leetcode.com/problems/pacific-atlantic-water-flow/][Pacific Atlantic Water Flow]]
  - [[https://leetcode.com/problems/number-of-islands/][Number of Islands]]
  - [[https://leetcode.com/problems/longest-consecutive-sequence/][Longest Consecutive Sequence]]
  - [[https://leetcode.com/problems/alien-dictionary/][Alien Dictionary (Leetcode Premium)]]
  - [[https://leetcode.com/problems/graph-valid-tree/][Graph Valid Tree (Leetcode Premium)]]
  - [[https://leetcode.com/problems/number-of-connected-components-in-an-undirected-graph/][Number of Connected Components in an Undirected Graph (Leetcode Premium)]]
- Interval
  - [[https://leetcode.com/problems/insert-interval/][Insert Interval]]
  - [[https://leetcode.com/problems/merge-intervals/][Merge Intervals]]
  - [[https://leetcode.com/problems/non-overlapping-intervals/][Non-overlapping Intervals]]
  - [[https://leetcode.com/problems/meeting-rooms/][Meeting Rooms (Leetcode Premium)]]
  - [[https://leetcode.com/problems/meeting-rooms-ii/][Meeting Rooms II (Leetcode Premium)]]
- Linked List
  - [[https://leetcode.com/problems/reverse-linked-list/][Reverse a Linked List]]
  - [[https://leetcode.com/problems/linked-list-cycle/][Detect Cycle in a Linked List]]
  - [[https://leetcode.com/problems/merge-two-sorted-lists/][Merge Two Sorted Lists]]
  - [[https://leetcode.com/problems/merge-k-sorted-lists/][Merge K Sorted Lists]]
  - [[https://leetcode.com/problems/remove-nth-node-from-end-of-list/][Remove Nth Node From End Of List]]
  - [[https://leetcode.com/problems/reorder-list/][Reorder List]]
- Matrix
  - [[https://leetcode.com/problems/set-matrix-zeroes/][Set Matrix Zeroes]]
  - [[https://leetcode.com/problems/spiral-matrix/][Spiral Matrix]]
  - [[https://leetcode.com/problems/rotate-image/][Rotate Image]]
  - [[https://leetcode.com/problems/word-search/][Word Search]]
- String
  - [[https://leetcode.com/problems/longest-substring-without-repeating-characters/][Longest Substring Without Repeating Characters]]
  - [[https://leetcode.com/problems/longest-repeating-character-replacement/][Longest Repeating Character Replacement]]
  - [[https://leetcode.com/problems/minimum-window-substring/][Minimum Window Substring]]
  - [[https://leetcode.com/problems/valid-anagram/][Valid Anagram]]
  - [[https://leetcode.com/problems/group-anagrams/][Group Anagrams]]
  - [[https://leetcode.com/problems/valid-parentheses/][Valid Parentheses]]
  - [[https://leetcode.com/problems/valid-palindrome/][Valid Palindrome]]
  - [[https://leetcode.com/problems/longest-palindromic-substring/][Longest Palindromic Substring]]
  - [[https://leetcode.com/problems/palindromic-substrings/][Palindromic Substrings]]
  - [[https://leetcode.com/problems/encode-and-decode-strings/][Encode and Decode Strings (Leetcode Premium)]]
- Tree
  - [[https://leetcode.com/problems/maximum-depth-of-binary-tree/][Maximum Depth of Binary Tree]]
  - [[https://leetcode.com/problems/same-tree/][Same Tree]]
  - [[https://leetcode.com/problems/invert-binary-tree/][Invert/Flip Binary Tree]]
  - [[https://leetcode.com/problems/binary-tree-maximum-path-sum/][Binary Tree Maximum Path Sum]]
  - [[https://leetcode.com/problems/binary-tree-level-order-traversal/][Binary Tree Level Order Traversal]]
  - [[https://leetcode.com/problems/serialize-and-deserialize-binary-tree/][Serialize and Deserialize Binary Tree]]
  - [[https://leetcode.com/problems/subtree-of-another-tree/][Subtree of Another Tree]]
  - [[https://leetcode.com/problems/construct-binary-tree-from-preorder-and-inorder-traversal/][Construct Binary Tree from Preorder and Inorder Traversal]]
  - [[https://leetcode.com/problems/validate-binary-search-tree/][Validate Binary Search Tree]]
  - [[https://leetcode.com/problems/kth-smallest-element-in-a-bst/][Kth Smallest Element in a BST]]
  - [[https://leetcode.com/problems/lowest-common-ancestor-of-a-binary-search-tree/][Lowest Common Ancestor of BST]]
  - [[https://leetcode.com/problems/implement-trie-prefix-tree/][Implement Trie (Prefix Tree)]]
  - [[https://leetcode.com/problems/add-and-search-word-data-structure-design/][Add and Search Word]]
  - [[https://leetcode.com/problems/word-search-ii/][Word Search II]]
- Heap
  - [[https://leetcode.com/problems/merge-k-sorted-lists/][Merge K Sorted Lists]]
  - [[https://leetcode.com/problems/top-k-frequent-elements/][Top K Frequent Elements]]
  - [[https://leetcode.com/problems/find-median-from-data-stream/][Find Median from Data Stream]]
