interview_preparation_v.html

<div id="outline-container-org852123a" class="outline-3">
<h3 id="org852123a">February 10, 2023</h3>
<div class="outline-text-3" id="text-org852123a">
<p>
In this meeting, we discussed the challenges of understanding problems before solving them.  We asked questions like what is our state of mind before and after we understand something?  Why is it so difficult to hold the urge to start solving the problem while we are reading it?  What can we use to improve our reading skills?  We discovered that by using active reading techniques, we can enhance our understanding of problems and improve our ability to solve them.
</p>

<p>
Let's start with an experiment:
</p>

<ul class="org-ul">
<li>Take a problem statement or a paragraph from a book that you never read before.</li>
<li>Read it as you normally read.</li>
<li>Close the book or switch to other tab in your browser and explain what you've read.</li>
<li>Do it again 3 to 5 times.</li>
</ul>

<p>
You will find that the recall became better and better with each repetition.  The first recall was disorganized and the last one was organized and fluid, like a story.  You might have tried to see part of the page with your mind's eye on the first recall.  But gradually, it became unnecessary as the chain of thoughts formed after each repetition.  You started empty and finished with a piece of knowledge inside yourself.
</p>

<p>
What did you feel on each repetition and how did it change over time?  I bet that recognizing this difference can help us understand when we should spend more time to really understand something.  I asked four people to do this experiment and to report what they felt.  The answers were essentially about becoming less anxious and disorganized and more calm and organized.  And this is the clue that we can use.
</p>

<p>
Our reading skills have everything to do with our problem solving skills.  As stated in the famous book "<a href="https://en.wikipedia.org/wiki/How_to_Solve_It">How To Solve It by George Polya</a>", the first step of solving a problem is understating it.  To understand the problem, we have to read it.  And let's be honest,  we usually read the problem once and try to solve it as we go along.
</p>

<p>
We tried to address the issue using active reading techniques.  Here is the process that we followed:
</p>

<ol class="org-ol">
<li>Read the problem quickly to get an overall idea.</li>
<li>Read the problem in normal speed to discover important parts.</li>
<li>Take a break and focus on the next 10 breathes (yep! like in meditation).</li>
<li>Read the problem slowly to ensure full understand.</li>
</ol>

<p>
After each step, ask yourself "What is this problem about?".  V and I tested this method in Leetcode problems and found an impressive improvement in recall quality.  The difference was "night and day".
</p>

<p>
In conclusion, I will incorporate active reading in my training routine and will report back the results in the future.
</p>
</div>
</div>
</div>


<div id="outline-container-org7150dff" class="outline-2">
<h2 id="org7150dff">Cited by 1</h2>
<div class="outline-text-2" id="text-org7150dff">
<ul class="org-ul">
<li><a href="index.html#ID-8B3C6E28-3ACB-47BB-B6B0-E1A0F35719A0">Welcome to my problem solving notes!</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>